In [1]:
import pandas as pd

In [2]:
transactions = pd.read_excel('./ids.xlsx')
transactions.head()

             id category    amount
0  600748331392        C  17515.36
1  600748331404        B  10117.56
2  600748331412        B  18489.26
3  600748331430        B   6620.22
4  600748331447        C    7559.9

In [3]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        49 non-null     object
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

### 1

Переведите значения столбца 'id' из строк в числа методом to_numeric().

In [4]:
# Преобразуем столбец 'id' в числовой тип, пропуская неудачные преобразования
transactions['id'] = pd.to_numeric(transactions['id'], errors='coerce')

### 2

Попробуйте ещё раз перевести значения столбца 'id' из строк в числа методом to_numeric(), но уже со значением 'coerce' параметра errors. Это заменит вызывающий ошибку Null на NaN.
Полученную таблицу выведите на экран методом tail(): так как ошибка возникает на последней строке, 5 значений с конца будет достаточно.

In [5]:
transactions.tail()

              id category    amount
44  6.007483e+11        A   8958.23
45  6.007483e+11        C   12771.1
46  6.007483e+11        E   9630.56
47  6.007483e+11     Null      Null
48           NaN        A  14327.22

### 3

Методом to_numeric() превратите значения столбца amount в числа, заменив некорректные значения на NaN. Проверьте результаты преобразований методом info().

In [6]:
transactions['amount'] = pd.to_numeric(transactions['amount'], errors='coerce')

In [7]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    45 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.3+ KB

### 4

Посчитайте общую стоимость проданных товаров — сумму значений столбца amount в датафрейме transactions. Результат выведите на экран.

In [8]:
transactions['amount'].sum()

np.float64(596107.1)

### 5

Рассчитайте сумму продаж для каждой категории. 

Для этого сгруппируйте датафрейм transactions по столбцу category и примените метод sum() к столбцу amount. 

Выведите результат на экран.

In [9]:
transactions.groupby('category').agg({'amount': ['sum']})

             amount
                sum
category
A         133988.50
B         168617.89
C         173332.50
D          62630.82
E          57537.39
Null           0.00

### 6


Вернитесь к таблице с трафиком: вы сможете найти сумму визитов.

Раньше вместо неё получались склеенные названия категорий, а столбец visits определялся как строковый (тип object).

Переведите значения столбца visits датафрейма data в числовой тип методом to_numeric().

In [10]:
data = pd.read_excel('./seo_data.xlsx', sheet_name='traffic_data')
#data['visits'] = pd.to_numeric(data['visits'], errors='coerce')
data.head()

  subcategory_id  source         visits
0     cf2e61c7af  direct  501165.668858
1     0cd903d1cc  direct  126342.359505
2     ef35bc88a7  direct   95626.321402
3     6ff9f4014c  direct   75680.653002
4     72bc238e4d  direct   64435.934651

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
dtypes: object(3)
memory usage: 45.4+ KB

### 7

Узнайте, что не так со строкой 964. Вызовите знакомый из вводного курса метод loc.

Он позволяет обращаться к датафрейму по значению индекса, в нашем случае как раз по номеру строки.

In [12]:
data.loc[964]

subcategory_id        total
source               direct
visits            "2369468"
Name: 964, dtype: object

### 8

Вычислите, сколько всего строк в датафрейме и выведите на экран в формате:

Количество строк: 1000

Затем выведите на экран строки, которые имеют значение 'total' в столбце 'subcategory_id'. Изучите полученные результаты: сколько строк портят весь датасет?

In [13]:
print(f'Количество строк: ', data.shape[0])

Количество строк:  1930

In [14]:
data[data['subcategory_id'] =='total']

     subcategory_id   source     visits
964           total   direct  "2369468"
1929          total  organic  "5687882"

### 9

Оставьте в датафрейме только строки, удовлетворяющие условию data['subcategory_id'] != 'total'. 

Проверьте результат: выведите на экран датафрейм с условием data['subcategory_id'] == 'total'.

In [15]:
data = data[data['subcategory_id'] != 'total']

In [16]:
data[data['subcategory_id'] == 'total']

Empty DataFrame
Columns: [subcategory_id, source, visits]
Index: []

### 10

Измените тип данных в столбце ['visits'] на integer. Проверьте полученный результат, вызвав метод info().

In [17]:
data['visits'] = data['visits'].astype('int')
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1928 entries, 0 to 1928
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1928 non-null   object
 1   source          1928 non-null   object
 2   visits          1928 non-null   int64
dtypes: int64(1), object(2)
memory usage: 60.2+ KB

### 11

Сгруппируйте данные по источникам и вычислите количество визитов для каждого источника. Выведите результат на экран.

In [18]:
data.groupby('source')['visits'].sum()

source
direct     2368980
organic    5687407
Name: visits, dtype: int64